verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/juan-t/Descargas/demo_zephyr_litex/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv.v
read_verilog /home/juan-t/Descargas/my_bios/ETH_SD_SDRAM_litex/build/gateware/colorlight_i5.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top colorlight_i5
write_json  colorlight_i5.json